Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Meow Rangers.tmx
Source language: ko_kr
Languages: en_us

source: 잠깐...!
en_us: WAIT...!

source: 이게 단위가 굉장히 중요합니다...
en_us: THE UNITS OF MEASUREMENT ARE EXTREMELY IMPORTANT...

source: 크학
en_us: COUGH

source: 뭘 가져 왔나 했더니 이런 거였나!!
en_us: I WAS WONDERING WHAT YOU BROUGHT, AND THIS IS IT?!

source: 행복은 나눌수록 커지잖아요.
en_us: THEY SAY SHARING IS CARING.

source: 이혜민, 역시 얍삽이!!
en_us: YOU’RE SNEAKY AS ALWAYS, HYEMIN!

source: 민지야, 전학 언제가?
en_us: MINJI, WHEN ARE YOU TRANSFERRING SCHOOLS?

source: 곧 죽어도 자신들이 믿는 [정의]를 위해 싸우던 녀석들이었는데.
en_us: ...FOUGHT TO THE DEATH TO PRESERVE THE JUSTICE THEY BELIEVED IN.

source: 야옹~
en_us: MEOW

source: 고통받는 냥인들을...
en_us: TO FREE...

source: 눈이 침침해...!
en_us: MY EYESIGHT IS BLURRY...!

source: 소중한 사람인가 보지.
en_us: I GUESS HE’S GOT A SOFT SPOT FOR ME.

source: 후우...
en_us: PHEW...

source: 다...당신은...!
en_us: Y-YOU...!!

source: 폴 리 스 당 구 장
en_us: POLICE BILLARD HALL

source: 슈 우 욱
en_us: SWOOP

source: 그냥 맞기만 하라고 했을텐데!!
en_us: I TOLD YOU TO STOP FIGHTING BACK!

source: 부시럭
en_us: RUSTLE

source: 네가 집사레인저가 된 거야.
en_us: SO THAT’S HOW YOU BECAME A MEOW RANGER.

source: ...캣슈트...!?
en_us: MY CATSUIT...?!

source: 덤벼 봐.
en_us: COME AT ME.

source: 파 아
en_us: BZZZ

source: [스핑크스]-!!
en_us: SPHYNX!!

source: 하악-!!
en_us: HACK!!

source: 살아있는 신이 된다.
en_us: HE’LL BECOME A LIVING GOD.

source: - 악당의 사정 (1) -
en_us: - THE VILLAIN’S MOTIVES - (1)

source: 준비해라.
en_us: GET READY.

source: 제...
en_us: D..

source: 뭔가 다가온다-!!
en_us: SOMETHING’S GETTING CLOSER!!

source: 멈칫
en_us: FREEZE

source: 마...{j}말도 안 돼!
en_us: N-NO WAY...!{j}

source: 아 아
en_us: ZZZZ

source: 말도 안 돼!
en_us: NO WAY!

source: 너는 뭐할 건데.
en_us: WHAT ARE YOU GONNA DO?

source: 최점단 전투 장비엔 이 녀석이 쓰이지.
en_us: IT’S USED ON ALL OF THE LATEST BATTLE EQUIPMENT.

source: 탕
en_us: SLAM

source: 내가 갈게.
en_us: I’LL GO.

source: 감히 네로님을~
en_us: DARE~ ♪

source: 빠
en_us: WHACK

source: 까불기는...!!
en_us: ...YOU PUNK!!

source: 확실히 지금의 현민이라면...
en_us: RIGHT NOW, HYEONMIN...

source: 기침만 조금 나올 뿐!
en_us: I JUST COUGH A BIT!

source: 빙글
en_us: SWERVE

source: 괜찮아!?
en_us: ARE YOU OKAY?!

source: X발 장난하냐!!
en_us: ARE YOU FREAKING KIDDING ME?!

source: 엄청큰 로보트를 만들었을 정도로 실력있는 고양이라고!!
en_us: HE IS SO SKILLED HE EVEN BUILT A GIANT ROBOT!!

source: 까{j}드{j}득
en_us: GRIT{j}{j}

source: 하늘에...
en_us: WHAT IS THAT...

source: 위 이 잉
en_us: PRRRR

source: 막아야 돼...!!
en_us: I HAVE TO STOP THEM...!!!

source: - 전쟁터 (10) -
en_us: - BATTLEFIELD (10) -

source: 크흠...
en_us: AHEM

source: 롱캣이 나타났을때, 치와는 나를 깨우려 했지만..
en_us: WHEN LONG CAT APPEARED, CHIWA TRIED TO WAKE ME...

source: [불로영생]이 아닌...
en_us: NOT ONLY WOULD YOU GAIN ETERNAL LIFE...

source: 새로운 멤버가 필요해.
en_us: WE NEED A NEW MEMBER.

source: 그래, 차라리 고양이들에게 지배당하는 게 더 나은 세상이 될지도...
en_us: ACTUALLY, WE MIGHT BE BETTER OFF UNDER THE RULE OF CAT PEOPLE...

source: 업그레이드로 전보다 슈트의 유지 시간이 늘어나긴 했지만...!!
en_us: THE SUIT LASTS LONGER SINCE THE UPGRADE...

source: 캣닢 내놓으라고.
en_us: I SAID, GIVE US THE CATNIP.

source: 나...!!
en_us: I...

source: 주변 인프라 걱정없는 주상복합 아파트단지
en_us: MULTI-PURPOSE COMMERCIAL AND RESIDENTIAL APARTMENT COMPLEXES, WITH REQUISITE INFRASTRUCTURE INCLUDED

source: 울{j}컥
en_us: TEARY{j}

source: 말조심해.
en_us: WATCH YOUR MOUTH.

source: 학교는?
en_us: WHAT ABOUT SCHOOL?

source: 뭔데...!
en_us: WHAT..?!

source: 네로님.
en_us: MASTER NERO.

source: 으...응.
en_us: O-OKAY.

source: 그들의 안전이 더 우선입니다.
en_us: AND THEIR SAFETY IS MY PRIORITY.

source: 커헉
en_us: COUGH

source: 커헛!!!
en_us: UGH!!!

source: 아무리 그런 일이 있었다고 해도...
en_us: EVEN IF WHAT YOU SAY IS TRUE...

source: 오빠!!
en_us: HYEONMIN!!

source: 즉, 방 빼주셔야 한다는 말입니다.
en_us: IN OTHER WORDS, YOU MUST LEAVE.

source: 앗...눈부셔라..
en_us: AH... HOW BLINDING...

source: 깜돌을 먼저 구해주십시오...!!
en_us: ...SO PLEASE SAVE SHADOW FIRST...!!

source: 아이씨...
en_us: UGH...

source: 다행히 냥인들은 평화를 약속했고...
en_us: FORTUNATELY, THE CAT PEOPLE PROMISED PEACE...

source: ...이게 뭔 캣닢 뜯어 먹는 소리야.
en_us: IS SHE WASTED ON CATNIP...?

source: 이혜민, 네가 맨날 쓰던 얍삽이 콤보 입력 해!!
en_us: HYEMIN, DO THE SNEAK ATTACK COMBO YOU ALWAYS USE!!

source: 형씨...!!
en_us: BRO...!!

source: 어딜!!
en_us: DON’T YOU DARE!!

source: 네로님은 냥잼을 이식받아서 오랜 세월을 살아오셨으니까...
en_us: SINCE YOUR MEOW GEM TRANSPLANT, YOU’VE LIVED LONG ENOUGH...

source: 냥인한테 진 거야.
en_us: ...WE LOST TO THE CAT PEOPLE.

source: 위험햇!!
en_us: LOOK OUT!!

source: 후회 할 짓 하지마라.
en_us: DON’T DO ANYTHING YOU’LL REGRET.

source: 나갈래~
en_us: I WANNA GO OUT.

source: 두
en_us: DUN

source: 아저씨...
en_us: MISTER...

source: 우리가 패배한지 얼마 지나지 않아 지구에 그들이 찾아왔다.
en_us: THEY ARRIVED ON EARTH NOT LONG AFTER OUR DEFEAT.

source: 하긴 한 달 사이에 이렇게 많은 게 바뀔 줄 누가 알았을까.
en_us: OF COURSE, WHO COULD HAVE PREDICTED ALL OF THESE CHANGES IN THE LAST MONTH?

source: 자꾸 어디서 나타나는 거야!?
en_us: WHERE ARE THEY COMING FROM?!

source: 이 이야기를 끝내러!
en_us: LET’S PUT AN END TO THIS!

source: 진짜?
en_us: REALLY?

source: 2개월 내로 수명을 다 할 겁니다.
en_us: AND YOU WILL DIE WITHIN TWO MONTHS AFTER THAT.

source: 게이지 완충까지 [10초] 남았습니다.
en_us: [TEN SECONDS] TO RECHARGE.

source: 능력의 진정한 끝을 볼 수있는 건 재생능력을 가진 나밖에 없어.
en_us: SINCE I CAN HEAL RAPIDLY, I’M THE ONLY TEST SUBJECT WHO CAN SHOW YOU THE ULTIMATE POWER OF THIS ABILITY.

source: 그래서 네 시계까지 만들어 달라고 한 거야.
en_us: THAT’S WHY I ASKED HIM TO MAKE YOUR WATCH.

source: 뾱
en_us: FLIT

source: 꽈악
en_us: CLENCH

source: 다시 냥인들의 낙원으로 만들겁니다.
en_us: ...BACK INTO CAT PEOPLE’S PARADISE.

source: 울룩
en_us: BULGE

source: 팔이 풀리면 한 놈도 빠짐없이 목을 부러트려 주..
en_us: ONCE MY ARM IS FREE I’M GOING TO RIP EVERY SINGLE ONE OF YOU APART--

source: 우욱
en_us: NCH

source: 몰살 당하고 시작할 테지...
en_us: IS MASSACRE THE MEOW RANGERS AND HUMANS...

source: 아..
en_us: A...

source: 바등
en_us: WRIGGLE

source: 동맹을 제안할 리가 없잖아!
en_us: THERE’S NO WAY SHE’D PROPOSE AN ALLIANCE WITH ME!

source: 갑자기 날뛰고 있어!!
en_us: HE’S RUNNING RIOT ALL OF A SUDDEN!!

source: 아무런 일도 일어나지 않는게 오히려 더 수상했어.
en_us: THE FACT THAT NOTHING WAS GOING ON WAS EVEN MORE SUSPICIOUS.

source: 질리지도 않아?
en_us: AREN’T YOU SICK OF IT?

source: 촤악
en_us: SLASH

source: 너...너는...
en_us: Y-YOU...

source: 멈춰!
en_us: STOP!

source: 지구인 체형에 맞춘
en_us: REMODELING TO FIT

source: 다들...
en_us: WHERE IS...

source: 거...거짓말...!!
en_us: Y-YOU’RE LYING...!!

source: 아무리 지쳤어도 이렇게 쉽게 당할 녀석이 아닌데...
en_us: HE NEVER GOES DOWN THAT EASILY, EVEN IF HE REALLY IS EXHAUSTED...

source: 내 몸상태가 어떤지나 말해줘.
en_us: TELL ME THE RESULTS.

source: 나와.
en_us: GET UP.

source: 집사들에게 오더 내려!!
en_us: DISPATCH ORDERS TO THE MEOW RANGERS!!

source: 지구 정화 작전을 서두르고 있어.
en_us: HE’S BEEN RUSHING THE EARTH PURIFICATION OPERATIONS.

source: 굉장한 파워...!!
en_us: HIS POWER IS UNREAL...!!

source: 하지만 호열 아저씨가 저녀석 안에...!
en_us: BUT MR. HOYEOL IS STILL INSIDE...!

source: 부탁하네...
en_us: HOSIK FOR ME...

source: 마침 이런 시기에 병원에 오셔서...
en_us: COMING TO THE HOSPITAL IN THESE TIMES...

source: 치와...!
en_us: CHIWA...!

source: 다행이야...!
en_us: OH, THANK GOODNESS...!

source: 둘가 잃는 것보단 하나라도 챙기는 게 좋지않아?
en_us: ISN’T IT BETTER TO KEEP ONE THAN TO LOSE BOTH?

source: 더 이상 피할 수 없어...!!
en_us: I CAN’T DODGE HIM ANYMORE...!!

source: 이상한테...?
en_us: THAT’S ODD...

source: 오래살려다가 명을 재촉했군.
en_us: SO MY PLANS FOR A LONG LIFE HAVE BEEN CUT SHORT.

source: 검사 결과가 나쁘지 않아요.
en_us: YOUR TEST RESULTS AREN’T BAD.

source: 쩌적
en_us: CRACKLE

source: ...임...{j}임무는...
en_us: O-OUR MISSION...{j}

source: 내놔라...
en_us: YOUR WATCH...

source: 살아있는 걸 후회하게 될거다.
en_us: HE’LL LIVE TO REGRET IT.

source: 슈트의 디자인을 유지한 채 기능을 정지합니다.
en_us: SHUTTING DOWN FUNCTIONALITY WHILE MAINTAINING SUIT.

source: 어째서...?
en_us: BUT WHY...?

source: 깜돌을 도울까...?
en_us: SHOULD I HELP SHADOW...?

source: 너를 어떻게 믿지?
en_us: HOW CAN I TRUST YOU?

source: 근육이...
en_us: BUT WHAT ABOUT...

source: 그런게 아니야.
en_us: THAT’S NOT IT.

source: 위잉
en_us: WHIR

source: 이른바 화전양면전술.
en_us: IT’S THE SO-CALLED CARROT AND STICK APPROACH.

source: 찍찍!!! (으아아아아!!)
en_us: TWEEK TWEEK!!! (AAAAAGH!!)

source: 나 전학 갈 거 같아.
en_us: I THINK I HAVE TO TRANSFER SCHOOLS.

source: 대기해라.
en_us: STAY HERE.

source: 내가 졌어!!
en_us: I LOST!!

source: 다 같이 덮치자!
en_us: EVERYONE, ATTACK!

source: 안 내
en_us: GUIDE

source: 사용자 인식 안 됨.
en_us: USER NOT RECOGNIZED.

source: 좋아.
en_us: FINE.

source: 나갈래~!
en_us: I WANNA GO OUT!

source: 애초에 폭주할 가능성이 없는 실험체를 쓰는 것.
en_us: USE A TEST SUBJECT WITH NO CAPACITY TO LOSE CONTROL.

source: 전학생!?
en_us: IS SHE A TRANSFER STUDENT?!

source: 아.
en_us: AH.

source: - 전쟁터 (12) -
en_us: - BATTLEFIELD (12) -

source: 부웅
en_us: WHACK

source: 언제부터 오빠가 집사레인저 였던 건데!?
en_us: SINCE WHEN YOU WERE A MEOW RANGER!?

source: 뚜벅...
en_us: CLACK

source: 이 영역에 들어오는 순간 네 녀석을 찢어버릴 거다!!
en_us: THE MOMENT YOU COME CLOSE I’M GOING TO RIP YOU APART!

source: 네...
en_us: N-NERO...!!

source: 스윽..
en_us: PSHEENG

source: 뭐야!!
en_us: WHAT THE?!

source: 까득
en_us: GRIT

source: 아아...!!
en_us: AAAH...!!

source: 야옹아.
en_us: KITTY CAT.

source: 우{j}다{j}다
en_us: DASH{j}{j}

source: 자, 가자!
en_us: ALL RIGHT, LET’S GO!

source: 끼야악!!
en_us: EEEK!!

source: 아닌 척 하면서 우리들을 엄청 생각한다니까...
en_us: YOU CARE FOR US SO MUCH EVEN IF YOU PRETEND NOT TO...

source: 젠장...!!
en_us: DAMN IT...!!

source: 아저씨가 그 녀석 안에 있잖아요!!
en_us: ...YOU’RE STILL INSIDE HIM!!

source: 저것 봐!
en_us: LOOK AT THAT!

source: 이대로는 위험해!!
en_us: THIS COULD BE DANGEROUS!!

source: 모두가 지구 파견, 장치 작동 임무를 꺼려하던 이유를 알고 계십니까?
en_us: DO YOU KNOW WHY EVERYONE AVOIDED BEING DISPATCHED TO EARTH OR WORKING DEVICE OPERATIONS?

source: 오빠야말로..
en_us: YOU’RE ONE TO TALK...

source: 사람이 튀어나왔어!
en_us: SOME GUY JUST CAME OUT OF NOWHERE!

source: 네 녀석들이 없으면 심심하니까 따라가 볼까.
en_us: I’LL TAG ALONG. I’D BE TOO BORED WITHOUT YOU TWO ANYWAY.

source: 파 바 밧
en_us: PEW PEW PEW

source: 크윽
en_us: CLENCH

source: 죽고 싶지 않아...
en_us: I DON’T WANNA DIE...

source: ..놀라지 말고 들어.
en_us: STAY CALM... AND JUST LISTEN.

source: 이 쥐의 유전정보를 바꿀겁니다.
en_us: I WILL CHANGE THE GENETIC CODE OF THIS MOUSE.

source: 이거나 먹어라...!
en_us: EAT THIS...!

source: 그쪽을 노린다...!!
en_us: THAT’S WHERE I’LL AIM...!!

source: 못 받은
en_us: UNRECEIVED

source: 뭔데!?
en_us: WHAT IS IT?!

source: 내가 초등학교 6학년이고...
en_us: I WAS IN 6TH GRADE...

source: 같은 인간이면서 어떻게 그런 짓을...!
en_us: HOW COULD YOU DO THAT TO YOUR OWN KIND...!

source: 엘 에 이 P C 방
en_us: L.A. PC ROOM

source: 드...{j}들켰어..!!
en_us: TH-THEY FOUND ME...!!{j}

source: 슈 욱
en_us: PEW

source: 이기지 못해서 실망 했을까?
en_us: AND I WAS DISAPPOINTED BECAUSE YOU COULDN’T?

source: 캣건 재충전 완료.
en_us: CAT GUN RECHARGE COMPLETE.

source: 호식이를...
en_us: LOOK AFTER...

source: 제냐는 세호를 지키러 갔고...!
en_us: XENIA WENT TO PROTECT HIM...!

source: 어어!!
en_us: OH NO!!

source: 엄청난 규모의 싸움이 시작 되겠네...?
en_us: THIS WILL TRIGGER A MASSIVE FIGHT, NO...?

source: 박사와 내게도 그런 기회가 찾아온 거야.
en_us: SUCH AN OPPORTUNITY HAS FOUND YOU AND ME, DOC.

source: 샤 랄{j}라
en_us: WHOOSH

source: 확
en_us: WHISH

source: 튀어!
en_us: RUN!

source: 뭐야 이거...
en_us: WHAT THE...

source: 더럽게 심심하네.
en_us: I’M SO FURKING BORED.

source: 여긴 누구..?
en_us: WHO AM I...?

source: 이 정도 속도로 빨리 회복될 줄 몰랐습니다.
en_us: ...I NEVER KNEW THEY COULD RECOVER SO FAST.

source: 뭐...!!
en_us: WHAT...!!

source: 쮝!
en_us: TWEEK!

source: 귀여워라 '나갈래'라니!
en_us: THAT’S SO CUTE, YOU WANNA GO OUT?

source: 한 번 만 더 냥행성으 향한 내 충성심을 모욕하면...
en_us: IF YOU EVER QUESTION MY LOYALTY TOWARD CAT PLANET AGAIN...

source: 저런 움직임이 가능하다니...
en_us: HE CAN MOVE THAT WELL ALREADY...?

source: 늦어!!
en_us: THAT’S TOO LONG!!

source: 주상복합 아파트단지
en_us: WITH REQUISITE INFRASTRUCTURE INCLUDED

source: 전투불능이 된 부하들 때문에 냥잼을 포기하고 달아나셨죠?
en_us: YOU GAVE UP ON RETRIEVING THE MEOW GEMS BECAUSE YOUR LACKEYS LOST CONTROL OF THE BATTLE, DIDN’T YOU?

source: 아 아 아...
en_us: BZZZ

source: 부 우{j}웅
en_us: WHOOSH{j}

source: 에너지 과공급.
en_us: ENERGY OVERLOAD.

source: 타
en_us: DASH

source: 지옥이 되어버린 이 지구를,
en_us: I WILL TURN THIS HELLISH PLANET...

source: 경 찰
en_us: POLICE

source: 선전포고!?
en_us: A DECLARATION OF WAR?!

source: 오빠.
en_us: HYEONMIN.

source: 녀석을 당황시킬 미끼가 필요해...!!
en_us: I NEED SOME KIND OF BAIT TO CATCH HER OFF GUARD...!!

source: 냐아아아옹
en_us: MEOOOW

source: 고민해보겠습니다.
en_us: I WILL THINK IT OVER.

source: 큰일이다...!!
en_us: THIS IS BAD...!!

source: 무사해라!!
en_us: BE CAREFUL!!

source: 으
en_us: ;ANF

source: 기다려라!!
en_us: WAIT FOR ME!!

source: 탁
en_us: GRAB

source: 네...네로한테 갖다 바칠 녀석한테 줄 것 같냐!
en_us: Y-YOU THINK I’LL JUST GIVE IT OVER SO YOU CAN GIVE IT TO NERO?!

source: 커헉!!
en_us: OOF!!

source: 쥐....
en_us: MOUSE...

source: 둥
en_us: DUN

source: 죄책감 가지지 마세요...
en_us: SO DON’T FEEL GUILTY...

source: 거래를 하려면 진실성 있게 얘기해야겠지...
en_us: I SHOULD BE HONEST WITH YOU IF WE’RE GOING TO MAKE A DEAL...

source: 레이디?
en_us: LADY?

source: 이미 지구도 과포화 상태.
en_us: ...EARTH IS ALREADY CROWDED.

source: 나쁘지 않아.
en_us: NOT BAD.

source: 재밌겠군.
en_us: THAT’D BE FUN.

source: 큭큭
en_us: HAHA

source: 귀...귀가...
en_us: H-HIS EARS...

source: 라는 말이 있다고.
en_us: SO THE SAYING GOES.

source: 정체가 뭐길래 그 사실들을 알고 있는 거야...?
en_us: WHO THE HELL ARE YOU AND HOW DO YOU KNOW THAT...?

source: 남들이 싸우니까 덩달아 싸우는 집사지.
en_us: ...IS THE RANGER THAT FIGHTS SIMPLY BECAUSE THE OTHERS DO.

source: 조용-
en_us: SILENCE

source: 단지 동맹을 제안하러 왔을 뿐이다.
en_us: WE’RE ONLY HERE TO PROPOSE AN ALLIANCE.

source: 냐발.
en_us: FURK.

source: 뭔가 알고 있어?
en_us: WHAT DO YOU KNOW?

source: 피슝
en_us: SPLAT

source: 곧 모두가 위험해진다.
en_us: SOON, EVERYONE WILL BE IN DANGER.

source: 어...{j}언제부터!?
en_us: S-SINCE WHEN?!{j}

source: 버럭
en_us: SHOUT

source: 촤르르...
en_us: WHOOSH

source: 그나저나, 무슨 일로 찾아 오셨습니까?
en_us: ANYWAY, WHY DID YOU WANT TO SEE ME?

source: 휘적
en_us: FLAIL

source: 원하지 않았다고...!
en_us: ONLY TO BE A TOY FOR HUMANS...!

source: 첫 변신때 집사의 몸 속으로 들어간 나노로봇이 육체를 개조 시켜...
en_us: WHEN HE FIRST TRANSFORMED, NANOBOTS ENTERED HIS BODY AND BEGAN CHANGING HIS CELLS...

source: 아...
en_us: OH...

source: 호잇!!
en_us: HIYAA!!

source: 해방하기 위해서....
en_us: ...THE CAT PEOPLE THAT ARE SUFFERING...

source: 폴 짝
en_us: LEAP

source: 두둥
en_us: DU DUN

source: 역시 성능 확실하구만.
en_us: AS I THOUGHT, HE’S IN TOP FORM.

source: 미끼에 떼로 몰려드는 물고기 같아.
en_us: THEY’RE LIKE FISH SWARMING AROUND BAIT.

source: 이런 운명에서 벗어나게 해주고 싶을 뿐인데...
en_us: ...FROM THE SAME CRUEL FATE....

source: 낙원을 재건하는 것 말야.
en_us: IN OTHER WORDS, REBUILDING PARADISE.

source: 디비님..!
en_us: MASTER DB...!

source: 침울..
en_us: GLOOMY

source: 차악보다 최악을 선택할 거냐.
en_us: ARE YOU GONNA CHOOSE THE WORST OVER THE LESSER EVIL?

source: 우왓!
en_us: WHOA!

source: 이래라 할 건 더 아니야!!
en_us: WHO GIVES YOU THE RIGHT TO PREACH?!

source: 돌연변이와 일반 냥인의 게놈을 분석 비교한 결과...
en_us: WE COMPARED THE GENES OF AN ORDINARY CAT PERSON AND THOSE OF THE MUTANT PSYCHOKENETIC CAT PERSON...

source: 조금은 재밌는 곳이었어.
en_us: I HAD SOME FUN.

source: 호열아저씨가 안쪽에서 공격 하고 있는 거야...!!
en_us: THAT’S MR. HOYEOL ATTACKING FROM INSIDE...!!

source: 땅속에 통해 공격하면 볼수가 없어!!
en_us: OH CRAP!

source: 케헥!!!
en_us: GRAGH!!

source: 제대로 할 각오가 안 되어 있다면,
en_us: IF YOU LACK THE RESOLVE TO DO A PROPER JOB,

source: 꺄악!!
en_us: AGH!!

source: 꾸우욱
en_us: GRIP

source: 나...나 같은 건...
en_us: S-SOMEONE LIKE ME...

source: 발끈
en_us: RAGE

source: 업적을 쌓기 위해 제일 만만한 인간청소를 하러 온 것이냐?
en_us: ARE YOU HERE TO CONDUCT HUMAN WIPEOUT, THE EASIEST TASK OF THEM ALL?

source: 여기 숨어있더군요!!
en_us: HE WAS HIDING HERE!!

source: 추운 어둠 속에 숨을 수 밖에 없었다.
en_us: ...HAD NO CHOICE BUT TO HIDE IN THE COLD DARKNESS.

source: 네로님 먼저 가.
en_us: YOU GO AHEAD, MASTER NERO.

source: 네 활약이 아니라,
en_us: NOT FOR THE THINGS YOU’VE DONE...

source: 파워가 약해지는 게 [압축 근육 모드]의 단점.
en_us: ...BUT THE DOWNSIDE IS THAT I BECOME WEAKER.

source: 츠츠츠츳
en_us: PZZZT

source: 우리 엄마는 어떡할 건데!
en_us: WHAT ABOUT MOM?!

source: 아아...
en_us: OH...

source: 뭐랭.
en_us: WHAT ARE YOU TALKING ABOUT?

source: 사천왕들은 각자 타고나거나 극한으로 단련한 능력이 하나씩 있지.
en_us: ALL FOUR LIEUTENANTS HAVE AN INCREDIBLE TALENT THEY WERE BORN WITH OR DEVELOPED THROUGH RIGOROUS TRAINING.

source: 또 몸이...!!
en_us: MY BODY...!!

source: 두 개를 한 번에?
en_us: BUT TWO GEMS AT ONCE?

source: 켁!
en_us: UGH!

source: 연구에 도움이 될 거다.
en_us: IT WILL HELP THE RESEARCH.

source: 부빗
en_us: WIPE

source: 뾰 로 롱
en_us: WHOOSH

source: 거기 가고 싶어하더라?
en_us: AND SHE SAYS SHE WANTS GO THERE.

source: 진행시켜.
en_us: PROCEED.

source: 응?!
en_us: EH?!

source: 네로님과 겨뤘던 녀석 맞아?
en_us: DID HE ACTUALLY GO TOE TO TOE WITH MASTER NERO?

source: 파 바 박
en_us: SWOOSH WHAM

source: 화{j}아{j}악
en_us: WHOOSH{j}{j}

source: 저는 호식이가 부러웠어요...
en_us: I WAS JEALOUS OF HOSIK...

source: 하...{j}하지만, 협조해줄지는...
en_us: B-BUT, AS TO WHETHER HE’LL JOIN US OR NOT...{j}

source: 이...이혜민!!
en_us: H-HYEMIN!!

source: 좋아 이대로 필살기다!
en_us: NOW END IT WITH THE FINAL BLOW!

source: 늦었어!!!
en_us: IT’S TOO LATE!!!

source: 지형지물을 바꿔 위험 요소를 함선 밖으로 내보낸다.
en_us: IT ALSO ALTERS ITS SURROUNDINGS TO FEND OFF DANGEROUS ELEMENTS.

source: 잘 참았군.
en_us: THAT WAS BRAVE OF YOU,

source: 하지만...!!
en_us: BUT...!!

source: 이 ㅅㄲ가...!!
en_us: YOU BASTARD...!!

source: 방구석 여포인줄 알았는데...
en_us: I THOUGHT YOU WERE ALL TALK AND NO ACTION...

source: 캣건..!!
en_us: CAT GUN...!!

source: 변신할 타이밍을 놓쳤어...!
en_us: I MISSED THE TIME TO TRANSFORM...!

source: - 전쟁터 (08) -
en_us: - BATTLEFIELD (08) -

source: 냐아아앙ㅡ!!
en_us: MEOOOW!!!

source: 함께 하겠나?
en_us: WILL YOU JOIN ME?

source: 이 녀석들...
en_us: THESE TWO...

source: 콰드{j}득
en_us: RUMBLE{j}

source: 내가 싸우는 이유보다...
en_us: YOU THINK...

source: 나와 함께한 모두가 다시는 없을 훌륭한 전사였다.
en_us: ALL WHO SERVED WITH ME HAVE BEEN MAGNIFICENT WARRIORS BEYOND COMPARE.

source: 샤 악
en_us: WHOOSH

source: 조금 성가시겠군.
en_us: THIS IS GOING TO BE A LITTLE ANNOYING.

source: 도망쳐!!
en_us: RETREAT!!

source: 망설이는 것은 행성의 냥인들을 위협하는 행위다.
en_us: HESITATION THREATENS THE CAT PEOPLE OF OUR PLANET.

source: 집사레인저 패배 며칠 후-
en_us: A FEW DAYS AFTER THE DEFEAT

source: 냥인으로서 우리와 운명을 함께한다.
en_us: ...MY BUTLER WILL SHARE OUR FATE AS A CAT PERSON.

source: 과광
en_us: SLAM THUD

source: 뭐야 뭐야!?
en_us: OMG NO WAY!!

source: 내게 상처를 입힌다면, 소원을 들어주마.
en_us: IF YOU CAN STRIKE ME, I’LL GRANT YOUR WISH.

source: ...너무 빛나서 네로님밖에 안 보인다고.
en_us: YOU’RE SO RADIANT THAT YOU’RE THE ONLY ONE I SEE...

source: 지구 출신 냥인이라도 일부는 함선에 오를 수 있으니까요.
en_us: CERTAIN CAT PEOPLE FROM EARTH ARE ALLOWED TO BOARD.

source: 쿠{j}구{j}궁
en_us: SKID{j}{j}

source: 너무 순식간에 일어나는 기습공격이라 반응할 수가 없잖아..!
en_us: I CAN’T DEFEND AGAINST THESE SURPRISE ATTACKS...!

source: 찍찍!! (전부 되갚아주마아 아아아앗!!!)
en_us: TWEEK TWEEK...!! (FOR EVERY HUMILIATION COMMITTED AGAINST MOUSE PEOPLE...!!)

source: 떴어!!
en_us: IT’S FLOATING!!

source: ...어?
en_us: WHAT...?

source: 전학생 온다 그랬었지.
en_us: RIGHT, SOMEONE DID SAY WE’D GET A TRANSFER STUDENT.

source: 잡아.
en_us: GET HIM.

source: 당신말고.
en_us: NOT YOU.

source: 호오...
en_us: OHO...

source: 냐~
en_us: NYAAA

source: 오직 지쳐 쓰러지는 것만이 내 손을 벗어나는 방법.
en_us: KNOCKING YOURSELF OUT IS THE ONLY ESCAPE FROM ME.

source: 그 조그만 꼬맹이가,
en_us: THAT LITTLE KID...

source: 그 방식이 틀렸다는 것을.
en_us: ...THAT METHOD WAS WRONG.

source: 우리는 인간을 멸종시키기 위해 싸우는 전사라고!!
en_us: WE’RE WARRIORS FIGHTING TO EXTERMINATE HUMANKIND!!

source: 그거를 이제 우리가 편하게 속력이라고 부르기로 했는데...
en_us: SO TO MAKE IT EASY, WE’VE DECIDED TO CALL THAT SPEED...

source: 이 놈이 계속 쳐다보잖아.
en_us: THIS PUNK KEEPS STARING AT ME.

source: 세뇌파인 거지.
en_us: IT’S THE BRAINWASHING WAVE.

source: 그건!!
en_us: WHAT IS THAT?!

source: 네로라는 자가 우리를 찾아냈다.
en_us: SOMEONE CALLED NERO FOUND US.

source: 네 몸은 개조됐어.
en_us: YOU’VE BEEN REPROGRAMMED...

source: 쿠 당{j}탕
en_us: CRASH TUMBLE{j}

source: 내가 빠지면 모든 작전은 헛수고...!
en_us: IF I LEAVE, THE WHOLE OPERATION FALLS APART...!

source: 스르륵...
en_us: FADE

source: 끝까지 싸운다.
en_us: ...NO MATTER THE COST.

source: 내가...
en_us: HOW...

source: 풀썩
en_us: DROP

source: 체다.
en_us: CHEDDAR.

source: 그래, 너라고.
en_us: YES, YOU.

source: 몸은...
en_us: ARE YOU...

source: - 접선 -
en_us: - A SECRET RENDEZVOUS -

source: 어떻게 할까요~
en_us: WHAT CAN I DO~ ♪

source: 성능이 이렇게나 확실한데, 조사는 나중에 해도 되잖아?
en_us: HIS PERFORMANCE IS ALREADY TOP-NOTCH. CAN’T YOU RUN YOUR TESTS LATER?

source: 우 다 다
en_us: DASH

source: 동료들에게 더 이상의 민폐를 끼칠 수는 없거든.
en_us: ...BUT I CAN’T TROUBLE MY COLLEAGUES ANYMORE.

source: 캣타워처럼 길기만 한 놈이.
en_us: YOU’RE NOTHING BUT TALL, LIKE A CAT TOWER.

source: 뭐?!
en_us: WHAT?!

source: 어이 머슬!!!
en_us: HEY, MUSCLE!!!

source: 위이잉
en_us: PRRRR

source: 동식 선배..!
en_us: DONGSIK...!

source: 아....
en_us: AH...

source: - 전쟁터 (13) -
en_us: - BATTLEFIELD (13) -

source: 사랑합니다~
en_us: LOVE NERO~ ♪

source: 지금 지구는 냥인이 지배하고 있어.
en_us: CAT PEOPLE NOW RULE THE WORLD.

source: 우와아앗-!!
en_us: AAAAGH!!

source: 꾸욱
en_us: SQUEEZE

source: 고양야옹병원
en_us: GOYANG MEOW HOSPITAL

source: 오빠가 위험해!!
en_us: HYEONMIN’S IN DANGER!!

source: 설마 그거 가지고 내 탓하는 거야?
en_us: ARE YOU SERIOUSLY BLAMING ME FOR THAT?

source: 무리를 이끌던 '리더'라는 녀석이 이런 꼴이라니.
en_us: THEIR SO-CALLED “LEADER” IS BEDRIDDEN.

source: 열받게...!!
en_us: HE’S PISSING ME OFF...!!

source: 뭔가 방법이 있는 거야!?
en_us: DO YOU HAVE A PLAN?!

source: 공포감을 느끼는 상태로는 수행 능력이 조금 떨어지는 관계로...
en_us: BUT IN A STATE OF FEAR, HIS PERFORMANCE DECLINES...

source: 만약...또 다시 큰 싸움이 일어나면...
en_us: IF... THERE’S ANOTHER HUGE BATTLE...

source: 엄청난 힘이다..!!!
en_us: SHE’S AS STRONG AS EVER...!!!

source: 잘 받으마.
en_us: ...I’LL TAKE THEM.

source: 훌쩍
en_us: SNIFFLE

source: 마침, 장치를 작동시키기 위한 냥잼이 충분하군요.
en_us: FINALLY, THERE ARE ENOUGH MEOW GEMS TO ACTIVATE THE DEVICE...

source: 사천왕부터 구한다...!
en_us: I’VE GOT TO RESCUE MY LIEUTENANTS FIRST...!

source: 세뇌파의 효과는 굉장했다.
en_us: THE BRAINWASHING WAVE WAS EXTREMELY EFFECTIVE.

source: 이 비열한 자식들이!!!
en_us: YOU SNEAKY BASTARDS!!!

source: ...놀고있군...
en_us: YEAH RIGHT...

source: 과거 여성 핸드볼 선수 현재 XX고등학교 핸드볼부 코치
en_us: PAST HANDBALL ATHLETE AND CURRENT COACH FOR XX HIGH SCHOOL’S HANDBALL TEAM.

source: 그거.
en_us: COME ON.

source: 사이캣!!
en_us: PSYCAT!!

source: 직접 보게 되니, 조금은 놀랍...
en_us: BUT SEEING IT IN PERSON IS STILL A BIT SURPRISING--

source: 스톱.
en_us: STOP.

source: 그래서...
en_us: SO...

source: 맞습니다...
en_us: THAT’S CORRECT...

source: 아직 찍인의 원수를...
en_us: I HAVEN’T TAKEN MY REVENGE...

source: 아직 한대밖에 안 때렸으니까!!
en_us: I’VE ONLY HIT YOU ONCE!!

source: 마..{j}맙소사...!
en_us: H-HOLY SMOKES...!{j}

source: 캣슈트라는 건...
en_us: SURE ARE IMPRESSIVE...

source: 어른들고, 친구들도 아니고...
en_us: IT WASN’T THE ADULTS OR MY FRIENDS...

source: 구
en_us: MB

source: 탈 탈
en_us: SHAKE SHAKE

source: 냥행성의 냥인들은 이주 할 곳을 못 찾아 고통스러워 하고 있다.
en_us: THE CAT PEOPLE OF OUR HOMEWORLD ARE SUFFURING FOR LACK OF A PLACE TO MOVE.

source: 됐다.
en_us: ENOUGH.

source: 큰 게 온다.
en_us: SOMETHING BIG IS COMING.

source: ...한번에 알아들으라는 소리였다.
en_us: I NEEDED YOU TO HEAR ME OUT.

source: 겁었긴 했지.
en_us: REALLY WAS PRETTY FEARLESS.

source: 그래, 오늘 너 죽고 나 죽자...!!
en_us: FINE, LET’S BOTH DIE TODAY...!!

source: 아뇨, 잠깐만요.
en_us: NO, ONE MOMENT.

source: 협력...
en_us: ...HAVE TO...

source: 휘청
en_us: WOBBLE

source: 파 아 앗
en_us: FLARE

source: 보석...?
en_us: A GEM...?

source: 전동킥보드를 둘이서 타는 녀석은 인간 취급 안 해준다.
en_us: I DON’T TOLERATE PEOPLE WHO DOUBLE UP ON ELECTRIC SCOOTERS.

source: 흐 어 어 엉
en_us: WAAAA

source: 이번만 임시동맹이다.
en_us: IT’S A COALITION, JUST THIS ONCE.

source: 다 설명해줄 테니까 지금은 녀석들한테 집중해!!
en_us: I’ll explain later, stay focused!!

source: 이러다가 정말 냥잼이식술의 허가가 떨어지겠는 걸.
en_us: AT THIS RATE, ISN’T ONLY A MATTER OF TIME BEFORE HE GETS APPROVAL FOR MEOW GEM TRANSPLANT SURGERY.

source: 이제 다시 싸울 수 있어!
en_us: WE CAN FIGHT AGAIN!

source: 근육 녀석...!?
en_us: MUSCLE CAT...?!

source: 한 소녀였을 뿐이었다.
en_us: ...AN ORDINARY GIRL.

source: 우습군.
en_us: FUNNY.

source: 이것과 슈트를 결합해.
en_us: FUSE MY SUIT WITH THIS.

source: 언제까지 이용당할 거냐.
en_us: HOW MUCH LONGER ARE YOU GOING TO LET YOURSELF BE USED LIKE THAT?

source: 넌 이미 항상 최선을 다해서 싸워왔잖아.
en_us: YOU’VE ALWAYS DONE YOUR BEST TO FIGHT.

source: 이...인간은...?
en_us: WH-WHO IS THIS HUMAN...?

source: 왁자
en_us: BUSTLE

source: 이런 녀석들이 엮인다고.
en_us: TO KEEP YOU AWAY FROM PEOPLE LIKE HIM.

source: 슬금
en_us: SNEAK

source: 정신차리세요!!
en_us: MISTER!!

source: 약속한 건 지킨다.
en_us: I KEEP MY PROMISES.

source: 네로님의 직속 부하..
en_us: AS MASTER NERO’S DIRECT SUBORDINATES...

source: [풍선 근육 모드] 전환
en_us: CHANGING TO [INFLATED MUSCLE MODE].

source: 콰 과
en_us: THUMP WHAM

source: 뭘 하려고...!?
en_us: WHAT IS HE PLANNING..?!

source: 부스터!!
en_us: BOOSTER!!

source: 파 바
en_us: POW POW

source: 지구인 여러분.
en_us: CITIZENS OF EARTH.

source: 우...우호친선관계 증진..??
en_us: P-PROMOTING FRIENDLY RELATIONS...??

source: 뭐가 걱정인데.
en_us: WHAT’S BOTHERING YOU?

source: 둥실
en_us: FLOAT
